/*7.21 阶梯电价

成绩: 5 / 折扣: 0.8
北京市居民用电采用阶梯电价，全年用电在2880千瓦时之内部分，电价为0.48元/千瓦时，在2881千瓦时至4800千瓦时之间部分，电价为0.53元/千瓦时；超过4800千瓦时部分，电价为0.78元/千瓦时。要求从键盘上输入用电量，计算并输出需付电费。*/
#include <stdio.h>
int main()
{
    
    double m,e;
    //定义变量

    scanf("%lf\n",&e);
    //输入

    const double e1=(double)2880.0*0.48;
    const double e2=(double)e1+(4800.0-2880.0)*0.53;
    if(e<=2880)
    {
        m=(double)0.48*e;
    }
    else if (e<4800)
    {
        m=(e-2880)*0.53;
        m+=e1;
    }
    else
    {
        m=(double)e2+(e-4800)*0.78;
    }
    
    //运算

    printf("%.2lf\n",m);
    //输出

    return 0;
}