/*输入年月日，计算是该年的第多少天？

提示：天数累计时分为两种情况：

1 、整月的天数参与累加求和（考虑大月、小月、 2 月天数具体情况）

2 、不完整月的天数直接用某日参与累加即可。

3 、闰年条件：能被4整除但不能被100整除；能被400整除*/

#include <stdio.h>
int main()
{


	int a,b,c;
	int d=0;
	
    scanf("%d %d %d\n",&a,&b,&c); 
	if((a%4==0 && a%100!=0)||(a%400==0))//闰年
	{
	int e[12]={31,29,31,30,31,30,31,31,30,31,30,31};
	for(int i=0;i<b-1;i++)
	d=d+e[i];
	d=d+c;
	}
    
    else//非闰年
	{
    int e[12]={31,28,31,30,31,30,31,31,30,31,30,31};
	for(int i=0;i<b-1;i++)
	d=d+e[i];
	d=d+c;
	}
	printf("第%d天\n",d);

    return 0;
}